// //**************************************//// TASK 1 ////

//  Напишіть функцію, яка перевірятиме чи перший символ в рядку написаний в верхньому регістрі, чи ні.


console.log("task 1");
function upperCase(str) {
  regexp = /^[A-Z]/;
  if (regexp.test(str)) {
    console.log("String's first character is uppercase");
  } else {
    console.log("String's first character is not uppercase");
  }
}
upperCase("regexp");
upperCase("RegExp");


// //**************************************//// TASK 2 ////


//   Напишіть функцію, яка приймає рядкові дані і виконує перевірку на їх відповідність емейлу. Валідними вважаються всі символи на різних позиціях.
// 	Приклад роботи:
// checkEmail("Qmail2@gmail.com");
// true


console.log("task 2");

function checkEmail(str) {
  const reg = /\S+@\S+\.\S+/;

  return reg.test(str);
}
console.log(checkEmail("Qmail2@gmail.com"));


// //**************************************//// TASK 3 ////


//  Напишіть регулярний вираз, який знаходитиме в тексті одну літеру d, за якою йде одна чи більше b, за якими одна d. Запам’ятати знайдені b і наступну за ними d.  Враховувати верхній і нижній регістр.
// 	Приклад роботи:   
// Для стрінги "cdbBdbsbz" результат ["dbBd", "bB", "d"]
console.log("task 3");


let re = /d(B+)(d)/gi;
let myArray = re.exec("cdbBdbsbz");
console.log(myArray);

// //**************************************//// TASK 4 ////


// Напишіть регулярний вираз, який в рядковому тексті 2 підстрічки буде міняти місцями.
// 	Приклад роботи:
// Вхідний рядок    "Java Script"
// Вихід    “Script, Java”



console.log("task 4");

function reg(str) {
  const reg = /\w+/g;

  return str.match(reg).reverse().join(",");
}

console.log(reg("Java Script"));



// //**************************************//// TASK 5 ////

//Напишіть функцію, яка виконуватиме валідацію номера банківської карти (9999-9999-9999-9999).

console.log("task 5");

function creditCard(str) {
  let creditCard = /^\d{4}-\d{4}-\d{4}-\d{4}$/;
  if (creditCard.test(str)) {
    return true;
  } else {
    return false;
  }
}
console.log(creditCard("9999-9999-9999-9999"));


// //**************************************//// TASK 6 ////


// Напишіть функцію, яка приймає рядкові дані і виконує перевірку на їх відповідність емейлу.
// 	Вимоги:
// •  Цифри (0-9).
// •  Тільки латинські літери в великому (A-Z) і малому (a-z) регістрах.
// •  В тілі емейла допустимі лишеі символи “_” і “-”. Але вони не можуть бути 1-им символом емейлу.
//  •  Символ “-” не може повторюватися.

// checkEmail('my_mail@gmail.com'); 
// Email is correct!
// checkEmail('#my_mail@gmail.com');
// Email is not correct!












// //**************************************//// TASK 7 ////


// Напишіть функцію, яка перевіряє правильність логіна. Правильний логін - рядок від 2 до 10 символів, що містить лише букви та цифри, номер не може бути першим. Функція має приймати рядок і знаходити усі числа в цьому рядку, включаючи числа з плаваючою комою (наприклад, 3.4).
// 	Приклад роботи:
// checkLogin('ee1.1ret3');
// true 
// 1.1, 3

// checkLogin('ee1*1ret3');
// false 
// 1, 1, 3
